"use client";

import { useForm } from "react-hook-form";
import { z } from "zod";
import { zodResolver } from "@hookform/resolvers/zod";
import {
  Button,
  Divider,
  Group,
  PasswordInput,
  Stack,
  Text,
  TextInput,
} from "@mantine/core";
import React from "react";
import { BiSolidLeftArrow } from "react-icons/bi";
import { signIn } from "next-auth/react";

const loginSchema = z.object({
  username: z.string().min(1, { message: "اسم المستخدم مطلوب" }),
  password: z.string().min(1, { message: "كلمة المرور مطلوبة" }),
});

type LoginFormInputs = z.infer<typeof loginSchema>;

const DashboardAuth = () => {
  const {
    register,
    handleSubmit,
    formState: { errors },
  } = useForm<LoginFormInputs>({
    resolver: zodResolver(loginSchema),
  });

  const onSubmit = async (data: LoginFormInputs) => {
    try {
      const res = await signIn("credentials", {
        identifier: data.username,
        password: data.password,
        callbackUrl: "/dashboard",
        redirect: false,
      });

      if (res?.error) {
        alert("Error signing in");
      }
    } catch (error) {
      console.error("An error occurred:", error);
    }
  };

  return (
    <Stack dir="rtl" className="h-screen bg-[#f6f7fa]">
      <Group className="m-10">
        <BiSolidLeftArrow
          className="mt-2"
          size={25}
          color="rgb(var(--color-accent-light))"
        />
        <Text className="text-3xl font-bold">لوحة التحكم</Text>
      </Group>
      <Group className="lg:mx-10 lg:mt-10 lg:flex-nowrap xl:mx-40 xl:mt-20">
        <div>
          <svg
            width="378"
            height="312"
            viewBox="0 0 378 312"
            fill="none"
            xmlns="http://www.w3.org/2000/svg"
          >
            <g clip-path="url(#clip0_536_1085)">
              <path
                d="M273.067 183.171H347.563V252.906H273.067V183.171Z"
                fill="#6DB5DE"
              />
              <path
                d="M242.625 277.153H378V158.925H242.625V277.153ZM377.2 276.352H243.426V159.726H377.194V276.352H377.2Z"
                fill="#6DB5DE"
              />
              <path
                d="M57.022 114.124C88.5137 114.124 114.044 88.5766 114.044 57.0641C114.044 25.5515 88.5137 0.00439453 57.022 0.00439453C25.5302 0.00439453 -7.62939e-06 25.5515 -7.62939e-06 57.0641C-7.62939e-06 88.5766 25.5302 114.124 57.022 114.124ZM57.022 0.846946C88.046 0.846946 113.202 26.0144 113.202 57.0641C113.202 88.1137 88.0512 113.281 57.022 113.281C25.998 113.281 0.841988 88.1137 0.841988 57.0641C0.841988 26.0144 25.9928 0.846946 57.022 0.846946Z"
                fill="#6DB5DE"
              />
              <path
                d="M51.5632 83.5727C36.9243 79.6204 28.2589 64.5413 32.2086 49.8927C36.1584 35.2441 51.2274 26.573 65.8664 30.5253C80.5053 34.4777 89.1707 49.5567 85.221 64.2053C81.2713 78.8539 66.2022 87.525 51.5632 83.5727Z"
                fill="#6DB5DE"
              />
              <path
                d="M12.9573 140.369L29.2646 149.791L19.8493 166.109L3.54203 156.688L12.9573 140.369Z"
                fill="#011A77"
              />
              <path
                d="M261.853 48.9125L278.16 58.334L268.745 74.6521L252.437 65.2305L261.853 48.9125Z"
                fill="#6DB5DE"
              />
              <path
                d="M35.6785 243.201L51.9858 252.622L42.5705 268.94L26.2632 259.519L35.6785 243.201Z"
                fill="#E5E5E5"
              />
              <path
                d="M303.504 211.226H317.121V224.852H303.504V211.226Z"
                fill="#1B77CB"
              />
              <path
                d="M51.9783 57.5798C51.6884 53.8568 54.4693 50.6036 58.1898 50.3135C61.9103 50.0233 65.1614 52.8061 65.4513 56.5291C65.7413 60.252 62.9603 63.5052 59.2398 63.7954C55.5193 64.0855 52.2683 61.3027 51.9783 57.5798Z"
                fill="#1B77CB"
              />
              <path
                d="M81.8215 148.888L116.804 169.099L96.6062 204.104L61.624 183.893L81.8215 148.888Z"
                fill="#1B77CB"
              />
              <path
                d="M68.6801 310.969H285.567V312.004H68.6801V310.969Z"
                fill="#CBCBCB"
              />
              <path
                d="M203.259 171.578C205.635 168.526 205.084 164.126 202.033 161.749C201.705 161.494 201.362 161.27 200.993 161.078L202.454 145.137L192.989 141.886L191.243 164.422C189.663 167.974 191.258 172.135 194.814 173.716C197.786 175.048 201.274 174.158 203.259 171.578Z"
                fill="#FFB8B8"
              />
              <path
                d="M193.098 80.1043C193.098 80.1043 186.607 66.4674 180.832 71.2627C175.063 76.0579 188.743 116.381 188.743 116.381L190.822 155.523L201.789 154.426L204.886 116.293L193.098 80.1043Z"
                fill="#CCCCCC"
              />
              <path
                d="M280.198 281.849L272.059 288.444L242.771 260.167L254.782 250.436L280.198 281.849Z"
                fill="#FFB8B8"
              />
              <path
                d="M280.126 277.506L264.096 290.493C258.452 295.065 257.579 303.345 262.147 308.993L262.418 309.326L288.665 288.064L280.126 277.506Z"
                fill="#2F2E41"
              />
              <path
                d="M167.069 300.157H156.596L151.612 259.735H167.069V300.157Z"
                fill="#FFB8B8"
              />
              <path
                d="M169.735 296.734H149.112C141.851 296.734 135.967 302.622 135.967 309.888V310.314H169.735V296.734Z"
                fill="#2F2E41"
              />
              <path
                d="M148.691 110.644C148.691 110.644 129.044 134.579 133.311 158.514C137.583 182.448 140.998 200.402 140.998 200.402L147.838 254.258C147.838 254.258 145.276 268.925 148.691 272.706C148.691 272.706 143.566 281.615 152.963 285.032C162.36 288.454 167.428 283.851 167.428 283.851C167.428 283.851 174.32 273.918 170.047 271.354L168.249 165.665L236.685 255.111C236.685 255.111 237.942 265.991 246.711 266.106L257.184 273.918L269.143 267.078L263.166 259.386C263.166 259.386 266.581 250.836 258.894 249.13L214.47 190.999L203.363 161.078C203.363 161.078 197.386 137.996 181.154 128.593V118.586L148.691 110.644Z"
                fill="#2F2E41"
              />
              <path
                d="M182.433 69.1873C177.08 62.8577 167.828 61.5471 160.931 66.1499L160.219 66.6232C152.636 75.2152 147.537 85.7159 145.479 96.9916L142.277 114.493L182.428 123.194L191.84 90.7088C194.309 82.2053 190.354 73.1452 182.433 69.1873Z"
                fill="#CCCCCC"
              />
              <path
                d="M116.466 175.297C120.671 173.924 122.968 169.394 121.591 165.187C121.445 164.739 121.258 164.302 121.035 163.886L132.615 149.703L125.718 140.56L109.637 160.823C105.863 163.179 104.714 168.151 107.074 171.927C109.049 175.089 112.932 176.483 116.466 175.297Z"
                fill="#FFB8B8"
              />
              <path
                d="M165.349 82.0025C165.349 82.0025 167.911 64.9069 159.366 65.7599C150.822 66.6128 138.01 113.629 138.01 113.629L114.943 152.096L126.05 158.077L153.389 123.886L165.349 82.0025Z"
                fill="#CCCCCC"
              />
              <path
                d="M149.704 57.0121H190.385C192.126 57.0121 193.54 55.5975 193.54 53.8552V36.3123C193.54 23.3256 183.02 12.7988 170.042 12.7988C157.064 12.7988 146.544 23.3256 146.544 36.3123V53.8604C146.549 55.5975 147.963 57.0121 149.704 57.0121Z"
                fill="#2F2E41"
              />
              <path
                d="M157.499 54.7866C148.994 50.522 145.555 40.1661 149.816 31.656C154.078 23.1458 164.427 19.7041 172.932 23.9687C181.436 28.2333 184.876 38.5893 180.614 47.0994C176.352 55.6095 166.003 59.0512 157.499 54.7866Z"
                fill="#FFB8B8"
              />
              <path
                d="M140.988 38.0651H162.667L162.89 34.492L164.002 38.0651H167.339L167.781 30.9814L169.985 38.0651H176.445V37.7114C176.445 27.4551 169.179 19.1128 160.245 19.1128H157.189C148.259 19.1128 140.988 27.4551 140.988 37.7114V38.0651Z"
                fill="#2F2E41"
              />
              <path
                d="M161.773 60.2887C162.038 60.2887 162.303 60.2679 162.563 60.2263L188.368 56.2476V29.3535C188.368 23.6324 183.732 18.9932 178.015 18.9932H159.964L160.666 19.7109C170.447 29.6811 163.077 45.8457 157.812 54.5885C157.017 55.8783 157.162 57.5374 158.16 58.6764C159.07 59.7218 160.39 60.3096 161.773 60.2887Z"
                fill="#2F2E41"
              />
            </g>
            <defs>
              <clipPath id="clip0_536_1085">
                <rect
                  width="378"
                  height="312"
                  fill="white"
                  transform="matrix(-1 0 0 1 378 0)"
                />
              </clipPath>
            </defs>
          </svg>
        </div>
        <Divider
          size="sm"
          color="rgb(var(--color-accent-dark))"
          orientation="vertical"
          h={400}
          mx={100}
        />
        <form
          onSubmit={handleSubmit(onSubmit)}
          className="mt-10 flex flex-col items-start gap-5 self-end p-5"
        >
          <TextInput
            {...register("username")}
            placeholder="اسم المستخدم"
            error={errors.username?.message}
            classNames={{
              input: "rounded-full border border-blue-500 xl:w-96 lg:w-72 h-12",
            }}
          />

          <PasswordInput
            {...register("password")}
            placeholder="كلمة المرور"
            error={errors.password?.message}
            classNames={{
              input: "rounded-full border border-blue-500 xl:w-96 lg:w-72 h-12",
            }}
          />

          <Button
            type="submit"
            radius="xl"
            className="h-10 bg-color-accent-medium px-10 text-white hover:bg-blue-600"
          >
            دخول
          </Button>
        </form>
      </Group>
    </Stack>
  );
};

export default DashboardAuth;
